langxing08/nRF52832-BLE-UART/nRF5_SDK_14.2.0_17b948a/project/ble_peripheral/ble_uart/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling uart rx timeout.
 *
 * @param[in] event_type    Timer event type. 
 * @param[in] p_context     Unused.
 */
void timer_uart_rx_timeout_event_handler(nrf_timer_event_t event_type, void* p_context)
{
	uint32_t err_code;
	
	nrf_drv_timer_disable(&TIMER_UART_RX);
	
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
			if(AT_cmd_check_valid(UART_RX_BUF, UART_RX_STA))  // AT command
			{
				AT_cmd_handle(UART_RX_BUF, UART_RX_STA);
			}
			else  // Pass-through data
			{
				err_code = ble_send_data(UART_RX_BUF, UART_RX_STA);
				NRF_LOG_INFO("first_send,err_code:%x", err_code);
				APP_ERROR_CHECK(err_code);
			}

			
			UART_RX_STA=0;
            break;

        default:
            //Do nothing.
            break;
    }
}


/**@brief Function for initializing hardware timer.
 */
void timer_uart_rx_timeout_init(void)
{
    uint32_t time_ticks;
    ret_code_t err_code;

	// Define and init timer_cfg struct
	nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
	
	// Init timer
	err_code = nrf_drv_timer_init(	&TIMER_UART_RX, 
									&timer_cfg, 
									timer_uart_rx_timeout_event_handler);// Register callback	
	APP_ERROR_CHECK(err_code);

	// Convert alarm time(ms) to ticks 
	time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER_UART_RX, UART_RX_TIMEOUT_INTERVAL);
	
	// Setup timer channel
	nrf_drv_timer_extended_compare(	&TIMER_UART_RX, 
									NRF_TIMER_CC_CHANNEL0,	// Timer channel 
									time_ticks, 
									NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, 
									true);	
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This initial and creates application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

	err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&wdt_feed_timer_id, 
								APP_TIMER_MODE_REPEATED, 
								wdt_feed_timer_handler);
    APP_ERROR_CHECK(err_code);		
}


/**@brief Function for initializing the wdt module. */
void wdt_init(void)
{
	// Configure WDT.
	uint32_t err_code = NRF_SUCCESS;
	
    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
	
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
	
    nrf_drv_wdt_enable();
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    timers_init();
	
	timer_uart_rx_timeout_init();

    uart_init();
    log_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
	
	wdt_init();
	wdt_feed_timers_start();

    printf("\r\nAT+RESET:OK\r\n");
    NRF_LOG_INFO("BLE_UART Start!");
	
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
//        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
		
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
